heatedRoom/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     buoyantPimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         120.00;

deltaT          0.02;

writeControl    adjustableRunTime;

writeInterval   0.5;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  on;

maxCo		1.0;


functions
{


rhoField
 {
    type     writeObjects;
    libs     ("libutilityFunctionObjects.so");
    writeControl    writeTime;
    objects
    (
      rho
    );
 }


	T_m_machine1
        {
                type            surfaceFieldValue;
                libs            ("libfieldFunctionObjects.so");
                writeControl    writeTime;
                log             yes;
                writeFields     no;
                regionType	patch;
                name            machine1;
                operation	areaAverage;
                //weightField     phi;
                surfaceFormat   foam;
                fields
                (
                        T
                );
        }
	T_m_machine2
        {
                type            surfaceFieldValue;
                libs            ("libfieldFunctionObjects.so");
                writeControl    writeTime;
                log             yes;
                writeFields     no;
                regionType	patch;
                name            machine2;
                operation	areaAverage;
                //weightField     phi;
                surfaceFormat   foam;
                fields
                (
                        T
                );
        }
	T_m_machine3
        {
                type            surfaceFieldValue;
                libs            ("libfieldFunctionObjects.so");
                writeControl    writeTime;
                log             yes;
                writeFields     no;
                regionType	patch;
                name            machine3;
                operation	areaAverage;
                //weightField     phi;
                surfaceFormat   foam;
                fields
                (
                        T
                );
        }

}

// ************************************************************************* //
