heatedRoom/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

xmin -1;
xmax 7;
ymin -4;
ymax 4;
zmin 0;
zmax 4;

vertices 
(

    ($xmin  $ymin  $zmin)
    ($xmax  $ymin  $zmin)
    ($xmax  $ymax  $zmin)
    ($xmin  $ymax  $zmin)
    ($xmin  $ymin  $zmax)
    ($xmax  $ymin  $zmax)
    ($xmax  $ymax  $zmax)
    ($xmin  $ymax  $zmax)

);

blocks 
(
    hex (0 1 2 3 4 5 6 7) (100 100 50) simpleGrading (1 1 1) //65
);

edges 
( 
);

boundary 
(
    
    	wall_4
	{
		type wall;
		faces	
		( 
			(0 4 7 3) 
		);
	}
   
	wall_5
	{
		type wall;
		faces	
		( 
			(1 2 6 5)
		);
	}

	wall_6
	{
		type wall;
		faces	
		( 
			(0 1 5 4)
		);
	}

	wall_1
	{
		type wall;
		faces	
		( 
			(3 7 6 2)
		);
	}

	ground
	{
		type wall;
		faces	
		( 
			(0 3 2 1)
		);
	}

	wall_3
	{
		type wall;
		faces	
		( 
			(4 5 6 7)
		);
	}

);

mergePatchPairs 
(
);
