heatedRoom/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 1e5;

boundaryField
{
    "wall_.*"
    {
        type             fixedFluxPressure;
        value            $internalField;
    }
    "machine.*"
    {
        type             fixedFluxPressure;
        value            $internalField;
    }
    inlet
    {
        type             fixedFluxPressure;
        value            $internalField;
    }
    outlet
    {
        type             fixedFluxPressure;
        value            $internalField;
    }
    ground
    {
        type             fixedValue;
        value            $internalField;
    }
}

// ************************************************************************* //
