heatedRoom/system/meshQualityDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      meshQualityDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

maxNonOrtho 70;

maxBoundarySkewness 6;
maxInternalSkewness 6;

maxConcave 70;

minVol 1e-15;

minTetQuality 1e-15;

minArea -1;

minTwist 0.02;

minDeterminant 0.01;

minFaceWeight 0.05;

minVolRatio 0.05;

minTriangleTwist -1;

minVolCollapseRatio 0.1;


// ************************************************************************* //
